;# **************************************************************************** #
;#                                                                              #
;#                                                         :::      ::::::::    #
;#    ft_strnew.s                                        :+:      :+:    :+:    #
;#                                                     +:+ +:+         +:+      #
;#    By: vlobunet <marvin@42.fr>                    +#+  +:+       +#+         #
;#                                                 +#+#+#+#+#+   +#+            #
;#    Created: 2020/02/15 16:23:36 by vlobunet          #+#    #+#              #
;#    Updated: 2020/02/15 16:23:38 by vlobunet         ###   ########.fr        #
;#                                                                              #
;# **************************************************************************** #

extern	_ft_memalloc

section	.text

global	_ft_strnew

_ft_strnew:
	push	rbp				; сохраням в стек адрес возврата
	mov		rbp, rsp		; вершина стека
	push	rdi				; сохраняем значение rdi

	call	_ft_memalloc

	pop		rdi				; возвращаем из стека указатель
	mov		rsp, rbp		; восстанавливаем адрес возврата
	pop		rbp
	ret
